Görev 1:  Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.

In [41]:
import seaborn as sns
df=sns.load_dataset("titanic")
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

Görev 2:  Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.

In [42]:
print(df["sex"].value_counts())

male      577
female    314
Name: sex, dtype: int64

Görev3:  Her bir sutuna ait unique değerlerin sayısını bulunuz.

In [43]:
for i in df.columns:
    print(df[i].nunique())

2
3
2
88
7
7
248
3
3
3
2
7
3
2
2

Görev4:  pclass değişkenini nunique değerlerinin sayısını bulunuz

In [44]:
print(df["pclass"].nunique())

3

Görev5:  pclass ve parch değişkenlerini nunique değerlerinin sayısını bulunuz

In [45]:
print(df["pclass"].nunique())
print(df["parch"].nunique())

3
7

Görev6:  embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz ve tekrar kontrol ediniz.

In [46]:
print(df["embarked"].dtype)
df["embarked"]=df["embarked"].astype('category')
print(df["embarked"].dtype)

object
category

Görev7:  embarked değeri C olanların tüm bilgelerini gösteriniz

In [47]:
c_olan = df[df['embarked'] == 'C']
print(c_olan)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
9           1       2  female  14.0      1      0  30.0708        C  Second
19          1       3  female   NaN      0      0   7.2250        C   Third
26          0       3    male   NaN      0      0   7.2250        C   Third
30          0       1    male  40.0      0      0  27.7208        C   First
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
866         1       2  female  27.0      1      0  13.8583        C  Second
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
879         1       1  female  56.0      0      1  83.1583        C   First
889         1       1    male  26.0      0      0  30.0000        C   First

       who  adult_male deck embark_town alive  alone
1    woman       False    C   Cherbourg   yes  False
9    child       False  NaN   Cherbourg   yes  False
19   woman       False  NaN   Cherbourg   yes   True
26     man        True  NaN   Cherbourg    no   True
30     man        True  NaN   Cherbourg    no   True
..     ...         ...  ...         ...   ...    ...
866  woman       False  NaN   Cherbourg   yes  False
874  woman       False  NaN   Cherbourg   yes  False
875  child       False  NaN   Cherbourg   yes   True
879  woman       False    C   Cherbourg   yes  False
889    man        True    C   Cherbourg   yes   True

[168 rows x 15 columns]

Görev 8:  embarked değeri S olmayanların tüm bilgelerini gösteriniz.

In [48]:
s_olmayan= df[df["embarked"]!= 'S']
print(s_olmayan)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
5           0       3    male   NaN      0      0   8.4583        Q   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
16          0       3    male   2.0      4      1  29.1250        Q   Third
19          1       3  female   NaN      0      0   7.2250        C   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
875         1       3  female  15.0      0      0   7.2250        C   Third
879         1       1  female  56.0      0      1  83.1583        C   First
885         0       3  female  39.0      0      5  29.1250        Q   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck embark_town alive  alone
1    woman       False    C   Cherbourg   yes  False
5      man        True  NaN  Queenstown    no   True
9    child       False  NaN   Cherbourg   yes  False
16   child       False  NaN  Queenstown    no  False
19   woman       False  NaN   Cherbourg   yes   True
..     ...         ...  ...         ...   ...    ...
875  child       False  NaN   Cherbourg   yes   True
879  woman       False    C   Cherbourg   yes  False
885  woman       False  NaN  Queenstown    no  False
889    man        True    C   Cherbourg   yes   True
890    man        True  NaN  Queenstown    no   True

[245 rows x 15 columns]

Görev9:   Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.

In [49]:
görev9= df[(df["age"]<30) & (df["sex"]== "female")]
print(görev9)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
2           1       3  female  26.0      0      0   7.9250        S   Third
8           1       3  female  27.0      0      2  11.1333        S   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
10          1       3  female   4.0      1      1  16.7000        S   Third
14          0       3  female  14.0      0      0   7.8542        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
880         1       2  female  25.0      0      1  26.0000        S  Second
882         0       3  female  22.0      0      0  10.5167        S   Third
887         1       1  female  19.0      0      0  30.0000        S   First

       who  adult_male deck  embark_town alive  alone
2    woman       False  NaN  Southampton   yes   True
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
14   child       False  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
880  woman       False  NaN  Southampton   yes  False
882  woman       False  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True

[147 rows x 15 columns]

Görev10:  Fare'i 500'den büyük veya yaşı70 den büyük yolcuların bilgilerini gösteriniz.

In [50]:
görev10= df[(df["fare"]<500) | (df["age"] > 70)]
print(görev9)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
2           1       3  female  26.0      0      0   7.9250        S   Third
8           1       3  female  27.0      0      2  11.1333        S   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
10          1       3  female   4.0      1      1  16.7000        S   Third
14          0       3  female  14.0      0      0   7.8542        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
880         1       2  female  25.0      0      1  26.0000        S  Second
882         0       3  female  22.0      0      0  10.5167        S   Third
887         1       1  female  19.0      0      0  30.0000        S   First

       who  adult_male deck  embark_town alive  alone
2    woman       False  NaN  Southampton   yes   True
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
14   child       False  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
880  woman       False  NaN  Southampton   yes  False
882  woman       False  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True

[147 rows x 15 columns]

Görev 11:  Her bir değişkendeki boş değerlerin toplamını bulunuz

In [51]:
print(df.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Görev 12:  who değişkenini dataframe’den çıkarınız.

In [52]:
df = df.drop('who', axis=1)

Görev13:  deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri(mode) ile doldurunuz.

In [53]:
mode1=df['deck'].mode()[0]
df["deck"]=df["deck"].fillna(mode1)

Görev14:  age değişkenindeki boş değerleri age değişkenin medyanı ile doldurunuz.

In [54]:
medyan=df["age"].median()
df["age"]=df["age"].fillna(medyan)

Görev 15:  survived değişkeninin pclass ve cinsiyet değişkenleri kırılımınında sum,count,mean değerlerini bulunuz.

In [55]:
import pandas as pd

def target_hepsi(dataframe,target,column):
    print(pd.DataFrame({"mean: ": dataframe.groupby(column)[target].mean()}))
    print(pd.DataFrame({"sum: ": dataframe.groupby(column)[target].sum()}))
    print(pd.DataFrame({"count: ": dataframe.groupby(column)[target].count()}))

target_hepsi(df,"survived","pclass")

          mean:
pclass
1       0.629630
2       0.472826
3       0.242363
        sum:
pclass
1         136
2          87
3         119
        count:
pclass
1           216
2           184
3           491

Görev 16:  30 yaşın altında olanlar 1 , 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazın. Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz. (apply ve lambda yapılarını kullanınız.)

In [121]:
def age_flag_func(age):
    return 1 if age < 30 else 0

df['age_flag'] = df['age'].apply(lambda age: age_flag_func(age))
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone,age_flag
0,0,3,male,22.0,1,0,7.2500,S,Third,True,C,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,False,C,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,True,C,Southampton,no,True,0

Görev 17:  Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.

In [86]:
dft=sns.load_dataset("tips")
dft.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Görev18:  Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [29]:
def target(dataframe,target,column):
    print(pd.DataFrame({"min: ": dataframe.groupby(column)[target].min()}))
    print(pd.DataFrame({"max: ": dataframe.groupby(column)[target].max()}))
    print(pd.DataFrame({"mean: ": dataframe.groupby(column)[target].mean()}))
    
target(dft,"total_bill","time")

        min:
time
Lunch    7.51
Dinner   3.07
        max:
time
Lunch   43.11
Dinner  50.81
           mean:
time
Lunch   17.168676
Dinner  20.797159

Görev19:  Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [40]:
def target_day_time(dataframe,target,column1,column2):
    print(pd.DataFrame({"min: ": dataframe.groupby([column1,column2])[target].min()}))

    
target_day_time(dft,"total_bill","time","day")

             min:
time   day
Lunch  Thur   7.51
       Fri    8.58
       Sat     NaN
       Sun     NaN
Dinner Thur  18.78
       Fri    5.75
       Sat    3.07
       Sun    7.25

Görev 20:  Lunch zamanına ve kadın müşterilere ait total_bill ve tip değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz

In [81]:
female_lunch=dft[(dft['time'] == 'Lunch') & (dft['sex'] == 'female')]
def target_female_lunch(dataframe,target,column):
    print(pd.DataFrame({"min: ": dataframe.groupby(column)[target].min()}))
    print(pd.DataFrame({"max: ": dataframe.groupby(column)[target].max()}))
    print(pd.DataFrame({"mean: ": dataframe.groupby(column)[target].mean()}))
    

target_female_lunch(female_lunch,"tip","day")

target_female_lunch(female_lunch,"total_bill","day")

      min:
day
Thur    NaN
Fri     NaN
Sat     NaN
Sun     NaN
      max:
day
Thur    NaN
Fri     NaN
Sat     NaN
Sun     NaN
      mean:
day
Thur     NaN
Fri      NaN
Sat      NaN
Sun      NaN
      min:
day
Thur    NaN
Fri     NaN
Sat     NaN
Sun     NaN
      max:
day
Thur    NaN
Fri     NaN
Sat     NaN
Sun     NaN
      mean:
day
Thur     NaN
Fri      NaN
Sat      NaN
Sun      NaN

Görev 21:size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir? (loc kullanınız)

In [100]:
siparis=((dft['total_bill'] > 10) & (dft['size']<3))
(dft.loc[siparis]).mean()

total_bill    17.184965
tip            2.638811
size           1.993007
dtype: float64

Görev22:  total_bill_tip_sum adında yeni bir değişken oluşturunuz. Her bir müşterinin ödediği total bill ve tip in toplamını versin.

In [113]:
dft["total_bill_tip_sum"] = dft["total_bill"] + dft["tip"]
dft["total_bill_tip_sum"].head()

0    18.00
1    12.00
2    24.51
3    26.99
4    28.20
Name: total_bill_tip_sum, dtype: float64

Görev23:  total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.

In [118]:
dft = dft.sort_values(by='total_bill_tip_sum', ascending=True)
yeni_df=dft.head(30)
yeni_df

     total_bill   tip     sex smoker   day    time  size  total_bill_tip_sum
67         3.07  1.00  Female    Yes   Sat  Dinner     1                4.07
92         5.75  1.00  Female    Yes   Fri  Dinner     2                6.75
111        7.25  1.00  Female     No   Sat  Dinner     1                8.25
195        7.56  1.44    Male     No  Thur   Lunch     2                9.00
218        7.74  1.44    Male    Yes   Sat  Dinner     2                9.18
149        7.51  2.00    Male     No  Thur   Lunch     2                9.51
135        8.51  1.25  Female     No  Thur   Lunch     2                9.76
145        8.35  1.50  Female     No  Thur   Lunch     2                9.85
126        8.52  1.48    Male     No  Thur   Lunch     2               10.00
222        8.58  1.92    Male    Yes   Fri   Lunch     1               10.50
6          8.77  2.00    Male     No   Sun  Dinner     2               10.77
30         9.55  1.45    Male     No   Sat  Dinner     2               11.00
43         9.68  1.32    Male     No   Sun  Dinner     2               11.00
235       10.07  1.25    Male     No   Sat  Dinner     2               11.32
53         9.94  1.56    Male     No   Sun  Dinner     2               11.50
148        9.78  1.73    Male     No  Thur   Lunch     2               11.51
75        10.51  1.25    Male     No   Sat  Dinner     2               11.76
82        10.07  1.83  Female     No  Thur   Lunch     1               11.90
10        10.27  1.71    Male     No   Sun  Dinner     2               11.98
1         10.34  1.66    Male     No   Sun  Dinner     3               12.00
16        10.33  1.67  Female     No   Sun  Dinner     3               12.00
226       10.09  2.00  Female    Yes   Fri   Lunch     2               12.09
117       10.65  1.50  Female     No  Thur   Lunch     2               12.15
168       10.59  1.61  Female    Yes   Sat  Dinner     2               12.20
233       10.77  1.47    Male     No   Sat  Dinner     2               12.24
136       10.33  2.00  Female     No  Thur   Lunch     2               12.33
196       10.34  2.00    Male    Yes  Thur   Lunch     2               12.34
172        7.25  5.15    Male    Yes   Sun  Dinner     2               12.40
169       10.63  2.00  Female    Yes   Sat  Dinner     2               12.63
132       11.17  1.50  Female     No  Thur   Lunch     2               12.67